# StairsInstUpArrowOn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsInstUpArrowOn Property
ParameterTypeId Class See Also
---
"Up arrow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsInstUpArrowOn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsInstUpArrowOn As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsInstUpArrowOn {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace